-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2020-11-06 14:01:37
-- 伺服器版本： 10.4.14-MariaDB
-- PHP 版本： 7.2.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `taroko`
--

-- --------------------------------------------------------

--
-- 資料表結構 `fix`
--

CREATE TABLE `fix` (
  `date1` timestamp NOT NULL DEFAULT current_timestamp(),
  `shopname` varchar(20) NOT NULL,
  `problem` text NOT NULL,
  `solution` text NOT NULL,
  `remark` text DEFAULT '',
  `engineer` varchar(10) NOT NULL,
  `file` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 MAX_ROWS=4294967295;

--
-- 傾印資料表的資料 `fix`
--

INSERT INTO `fix` (`date1`, `shopname`, `problem`, `solution`, `remark`, `engineer`, `file`) VALUES
('2020-10-15 06:45:13', '123', '123', '123', '', 'engineer', ''),
('2020-10-15 06:47:09', '泰山火鍋', 'd', 's', 'a', 'Cat', ''),
('2020-10-15 07:17:29', '泰山火鍋', '1111111', '22222222222', 'aaaaaaaaaa', 'Dog', ''),
('2020-10-15 07:18:00', 'canshop', '6666666666', '78978978979', 'bbbbbbb', 'Parrot', ''),
('2020-10-15 07:18:16', 'canshop', 'yes i do', '78978978979', 'bbbbbbb', 'Parrot', ''),
('2020-10-19 08:21:44', 'Happy day !', 'yyyyyyyyyyyyyyyyyyyyyyyyyyy', 'rrrrrrrrrrrrrrrrrrrrrrrrrrrrr', 'ttttttttttttttttttttttttttttttt', 'Parrot', ''),
('2020-10-20 09:59:36', 'babyshop', 'aaaaaaaa', 'bbbbbbbbbbbbb', 'cccccccccccc', 'monkey', ''),
('2020-10-20 10:08:02', 'babyshop', '你傳給我的機殼圖片，這是m-ATX小機殼，這一種是文書機在用的機殼，就算你要換高階顯卡，說不定可能會裝不進去，還有你這台是文書機的規格，電供我猜頂多450W，也就是說你如果要換高階顯卡，連電供也要換。', '你傳給我的機殼圖片，這是m-ATX小機殼，這一種是文書機在用的機殼，就算你要換高階顯卡，說不定可能會裝不進去，還有你這台是文書機的規格，電供我猜頂多450W，也就是說你如果要換高階顯卡，連電供也要換。', '你傳給我的機殼圖片，這是m-ATX小機殼，這一種是文書機在用的機殼，就算你要換高階顯卡，說不定可能會裝不進去，還有你這台是文書機的規格，電供我猜頂多450W，也就是說你如果要換高階顯卡，連電供也要換。', 'monkey', ''),
('2020-10-21 04:12:37', '一楓糖', 'aaaaaaaaa', 'sssssssssss', 'dddddddddddd', 'monkey', ''),
('2020-10-21 04:14:24', '一楓糖', 'aaaaaaaaa', 'sssssssssss', 'dddddddddddd', 'monkey', ''),
('2020-10-21 04:17:50', '一楓糖', 'aaaaaaaaa', 'sssssssssss', 'dddddddddddd', 'monkey', ''),
('2020-10-20 22:21:39', '泰山火鍋', '1', '2', '3', 'monkey', ''),
('2020-10-21 04:29:24', '泰山火鍋', '1', '2', '3', 'monkey', ''),
('2020-10-21 04:30:20', '123', '1', '2', '3', 'monkey', ''),
('2020-10-21 04:31:39', '123', '1', '2', '3', 'monkey', ''),
('2020-10-21 04:32:44', '123', '1', '2', '3', 'monkey', ''),
('2020-10-21 04:34:05', '123', '1', '2', '3', 'monkey', ''),
('2020-10-21 04:39:44', '123', '1', '2', '3', 'monkey', ''),
('2020-10-21 04:40:02', '78787878', '17878787', '27878787', '38787878', 'Parrot', ''),
('2020-10-24 08:49:42', '泰山火鍋', '111111111111111111111', '222222222222222222222', '33333333333333333333333', 'monkey', ''),
('2020-10-24 10:35:34', '糖果森林', '是我的就是我的', '是我的就是我的', '是我的就是我的', 'Dog', ''),
('2020-10-24 10:36:24', '糖果森林', '別去你家來我家', '別去你家來我家', '', 'Dog', ''),
('2020-10-24 11:40:40', '糖果森林', 'GitHub 可以交流程式的平台，它提供你一個空間來存放程式碼，這個空間是基於 Git 的版本控制系統，你能夠透過系統共同編輯平台上的程式專案，而這個系統是開放資源，也就是說全世界的人都可以找到你的 GitHub code，包括使用它、從中學習並將它改得更好。GitHub 提供一個非常實用的工具— GitHub Pages，它能讓你發佈網站。\r\nGoogle App Engine 是一個強大的平台，不管是要從頭建置 multi-tiered web 程式還是託管靜態網站，它都能讓你在 Google 的基礎下建置和運行應用程式。點選 How do you host your website on Google App Engine? 以獲得更多資訊。', 'GitHub 可以交流程式的平台，它提供你一個空間來存放程式碼，這個空間是基於 Git 的版本控制系統，你能夠透過系統共同編輯平台上的程式專案，而這個系統是開放資源，也就是說全世界的人都可以找到你的 GitHub code，包括使用它、從中學習並將它改得更好。GitHub 提供一個非常實用的工具— GitHub Pages，它能讓你發佈網站。\r\nGoogle App Engine 是一個強大的平台，不管是要從頭建置 multi-tiered web 程式還是託管靜態網站，它都能讓你在 Google 的基礎下建置和運行應用程式。點選 How do you host your website on Google App Engine? 以獲得更多資訊。', '', 'Dog', ''),
('2020-10-26 07:01:09', '泰山火鍋', '111111111111', '2222222222222', '33333333333333', 'monkey', ''),
('2020-10-26 07:01:20', '一楓糖', '111111111111', '2222222222222', '33333333333333', 'Dog', ''),
('2020-10-26 07:01:31', 'canshop', '111111111111', '2222222222222', '33333333333333', 'Hamster', ''),
('2020-10-27 06:38:37', '', '', '', '', '', ''),
('2020-10-27 06:42:30', '', '', '', '', '', ''),
('2020-10-27 06:43:00', '', '', '', '', '', ''),
('2020-10-27 06:43:45', '', '', '', '', '', ''),
('2020-10-27 06:44:29', '', '', '', '', '', ''),
('2020-10-27 06:48:41', '泰山火鍋', '1', '2', '3', 'monkey', ''),
('2020-10-27 07:49:33', '', '', '', '', '', ''),
('2020-10-27 07:50:26', '', '', '', '', '', ''),
('2020-10-27 07:50:27', '', '', '', '', '', ''),
('2020-10-27 07:50:28', '', '', '', '', '', ''),
('2020-10-27 07:50:28', '', '', '', '', '', ''),
('2020-10-27 07:50:28', '', '', '', '', '', ''),
('2020-10-27 07:51:36', '', '', '', '', '', ''),
('2020-10-27 07:58:29', '泰山火鍋', '3', '3', '3', 'monkey', ''),
('2020-10-27 07:59:44', '泰山火鍋', '3', '3', '3', 'monkey', ''),
('2020-10-27 08:07:05', 'babyshop', '2', '3', '4', 'monkey', ''),
('2020-10-27 09:25:40', '一楓糖', '11111111111111111111111', '22222222222222222223', '66666666666666666666', 'monkey', ''),
('2020-10-27 09:32:18', '', '', '', '', '', ''),
('2020-10-27 09:33:40', '泰山火鍋', '1', '2', '', 'monkey', ''),
('2020-10-27 09:58:45', '一楓糖', '1', '2', '3', 'monkey', ''),
('2020-10-27 09:59:07', 'babyshop', '1', '23', '3', 'Dog', ''),
('2020-10-28 10:02:29', '泰山火鍋', '1', '2', '3', 'monkey', ''),
('2020-10-28 10:21:18', 'MR', '1111111111', '11111111111111', '11111111111', 'monkey', ''),
('2020-10-28 13:22:12', 'baby', '我', '無', '療', 'monkey', ''),
('2020-11-02 10:08:52', '泰山火鍋', '1', '2', '', 'monkey', ''),
('2020-11-02 10:09:16', '一楓糖', '本文例項講述了php中使用session防止使用者非法登入後臺的方法。分享給大家供大家參考。具體如下：\r\n\r\n一般來說，我們登入網站後臺時，伺服器會把登入資訊儲存到session檔案裡，並通過讀取session檔案來判斷是否可以進行後臺操作。\r\n\r\n以下面為例，假如admin.php是我們的後臺操作頁面，如果沒有啟用 session，那麼，即便是沒有登入，使用者照樣能訪問到該頁面，這時候，就需要用到 session 來防止使用者非法登入到這個頁面了。下面是三個檔案的程式碼\r\n\r\n登入頁面：login.php\r\n\r\n ', '2本文例項講述了php中使用session防止使用者非法登入後臺的方法。分享給大家供大家參考。具體如下：\r\n\r\n一般來說，我們登入網站後臺時，伺服器會把登入資訊儲存到session檔案裡，並通過讀取session檔案來判斷是否可以進行後臺操作。\r\n\r\n以下面為例，假如admin.php是我們的後臺操作頁面，如果沒有啟用 session，那麼，即便是沒有登入，使用者照樣能訪問到該頁面，這時候，就需要用到 session 來防止使用者非法登入到這個頁面了。下面是三個檔案的程式碼\r\n\r\n登入頁面：login.php\r\n\r\n ', '', 'monkey', ''),
('2020-11-02 10:09:24', '123', '本文例項講述了php中使用session防止使用者非法登入後臺的方法。分享給大家供大家參考。具體如下：\r\n\r\n一般來說，我們登入網站後臺時，伺服器會把登入資訊儲存到session檔案裡，並通過讀取session檔案來判斷是否可以進行後臺操作。\r\n\r\n以下面為例，假如admin.php是我們的後臺操作頁面，如果沒有啟用 session，那麼，即便是沒有登入，使用者照樣能訪問到該頁面，這時候，就需要用到 session 來防止使用者非法登入到這個頁面了。下面是三個檔案的程式碼\r\n\r\n登入頁面：login.php\r\n\r\n ', '本文例項講述了php中使用session防止使用者非法登入後臺的方法。分享給大家供大家參考。具體如下：\r\n\r\n一般來說，我們登入網站後臺時，伺服器會把登入資訊儲存到session檔案裡，並通過讀取session檔案來判斷是否可以進行後臺操作。\r\n\r\n以下面為例，假如admin.php是我們的後臺操作頁面，如果沒有啟用 session，那麼，即便是沒有登入，使用者照樣能訪問到該頁面，這時候，就需要用到 session 來防止使用者非法登入到這個頁面了。下面是三個檔案的程式碼\r\n\r\n登入頁面：login.php\r\n\r\n ', '本文例項講述了php中使用session防止使用者非法登入後臺的方法。分享給大家供大家參考。具體如下：\r\n\r\n一般來說，我們登入網站後臺時，伺服器會把登入資訊儲存到session檔案裡，並通過讀取session檔案來判斷是否可以進行後臺操作。\r\n\r\n以下面為例，假如admin.php是我們的後臺操作頁面，如果沒有啟用 session，那麼，即便是沒有登入，使用者照樣能訪問到該頁面，這時候，就需要用到 session 來防止使用者非法登入到這個頁面了。下面是三個檔案的程式碼\r\n\r\n登入頁面：login.php\r\n\r\n ', 'monkey', ''),
('2020-11-02 10:10:51', '123', '1', '2', '3', 'monkey', ''),
('2020-11-02 10:11:58', '123', 'show table status like ', 'show table status like ', '', 'monkey', ''),
('2020-11-02 10:12:48', '123', 'show table status like ', 'show table status like ', '', 'monkey', ''),
('2020-11-02 10:12:52', '123', 'show table status like ', 'show table status like ', '', 'monkey', ''),
('2020-11-02 10:12:54', '123', 'show table status like ', 'show table status like ', '', 'monkey', ''),
('2020-11-02 10:12:55', '123', 'show table status like ', 'show table status like ', '', 'monkey', ''),
('2020-11-02 10:13:00', '123', 'show table status like ', 'show table status like ', '', 'monkey', ''),
('2020-11-02 10:14:11', '泰山火鍋', '連結檔的特色是，該行開頭的 10 個字元最左邊為 l (link) ，一般檔案為減號 (-) 而目錄檔為 d (directory)。 如上表所示，其實 /etc/rc0.d 與 /etc/rc.d/rc0.d 是相同的資料，其中 /etc/rc0.d 是連結檔，而原始檔為 /etc/rc.d/rc0.d。 此時讀者需要注意，亦即當你進入 /etc/rc0.d 時，代表實際進入了 /etc/rc.d/rc0.d 那個目錄的意思。', '連結檔的特色是，該行開頭的 10 個字元最左邊為 l (link) ，一般檔案為減號 (-) 而目錄檔為 d (directory)。 如上表所示，其實 /etc/rc0.d 與 /etc/rc.d/rc0.d 是相同的資料，其中 /etc/rc0.d 是連結檔，而原始檔為 /etc/rc.d/rc0.d。 此時讀者需要注意，亦即當你進入 /etc/rc0.d 時，代表實際進入了 /etc/rc.d/rc0.d 那個目錄的意思。', '', 'monkey', ''),
('2020-11-05 09:13:03', '123', '1', '2', '', 'monkey', ''),
('2020-11-05 11:49:21', '123', 'qqqq', 'wwwwww', 'eee', 'monkey', ''),
('2020-11-05 11:50:57', '123', 'qqqq', 'wwwwww', 'eee', 'monkey', ''),
('2020-11-05 11:51:13', '123', 'qq', 'ww', 'ee', 'monkey', ''),
('2020-11-05 11:53:59', '123', 'qq', 'ww', 'ee', 'monkey', ''),
('2020-11-05 11:58:20', '123', 'qq', 'ww', 'ee', 'monkey', ''),
('2020-11-05 11:58:54', '123', 'qq', 'ww', 'ee', 'monkey', ''),
('2020-11-05 11:59:14', '泰山火鍋', '1', '2', '3', 'monkey', ''),
('2020-11-05 13:29:23', '123', '321', '321', '', 'Parrot', ''),
('2020-11-06 05:06:19', '787878', '78', '78', '78\r\n', 'monkey', ''),
('2020-11-06 08:47:24', 'kill', '1', '2', '', 'monkey', ''),
('2020-11-06 08:53:18', 'kill', '1', '2', '', 'monkey', ''),
('2020-11-06 09:03:40', '878787', '1', '2', '3', 'Dog', ''),
('2020-11-06 09:11:51', '糖果森林', '1', '2', '', 'Hamster', '');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
